[
  {
    "slug": "ebay-laptop-buying-guide",
    "title": "I Think I Need a New Laptop: Zack's Foolproof Guide to Getting High-End Laptops from eBay on a $350 Budget",
    "date": "2025-10-07",
    "author": "Zachary Hartmann",
    "summary": "A comprehensive guide to finding powerful business-grade laptops on eBay for under $350. Learn the exact method for identifying high-performance refurbished machines that outperform new budget laptops.",
    "description": "A comprehensive guide to finding powerful business-grade laptops on eBay for under $350. Learn the exact method for identifying high-performance refurbished machines that outperform new budget laptops.",
    "detailedSummary": "Step-by-step guide to purchasing refurbished business-class laptops from eBay on a student budget. Covers CPU research strategy, eBay filter optimization, essential specifications, seller verification, and understanding the 'sweet spot' where 4-year-old high-end laptops deliver exceptional value for cybersecurity and networking students.",
    "file": "ebay-laptop-buying-guide.html",
    "tags": ["technical", "hardware", "laptops", "budget", "buying-guide", "student-resources"]
  },
  {
    "slug": "microsoft-aws-ai-opportunities",
    "title": "Level Up Your Resume: Seize the Microsoft and AWS AI Opportunities from the RIC Meetup",
    "date": "2025-09-30",
    "author": "Zachary Hartmann",
    "summary": "Key takeaways from the RIC Cyber Security Professionals Meetup: Microsoft Reactor Python + AI training and AWS AI Practitioner certification opportunities that can significantly boost your resume.",
    "description": "Key takeaways from the RIC Cyber Security Professionals Meetup: Microsoft Reactor Python + AI training and AWS AI Practitioner certification opportunities that can significantly boost your resume.",
    "detailedSummary": "Comprehensive guide to Microsoft Reactor Python + AI training and AWS AI Practitioner certification opportunities discovered at the RIC Cyber Security Professionals Meetup. Includes specific discount codes, registration links, and actionable steps for career advancement.",
    "file": "microsoft-aws-ai-opportunities.html",
    "tags": ["career", "certifications", "microsoft", "aws", "ai", "networking"]
  },
  {
    "slug": "crowdstrike-ncl-fall-workshop",
    "title": "CrowdStrike x NCL Fall Workshop: Building Careers and Connections in Cybersecurity",
    "date": "2025-10-22",
    "author": "Zachary Hartmann",
    "summary": "Key takeaways from the CrowdStrike x NCL Fall Workshop: internship opportunities, resume building tips, and how NCL competition experience translates to industry success.",
    "description": "Key takeaways from the CrowdStrike x NCL Fall Workshop: internship opportunities, resume building tips, and how NCL competition experience translates to industry success.",
    "detailedSummary": "Comprehensive recap of the CrowdStrike x NCL Fall Workshop featuring university recruiter Melanie and CrowdStrike professionals from incident response, threat hunting, intelligence, and red teaming. Covers CrowdStrike's internship programs (12-week summer internships and Launch program for freshmen/sophomores), resume preparation strategies, technical assessment insights using Cyber Skyline platform, and the direct connection between NCL competition experience and industry job requirements.",
    "file": "crowdstrike-ncl-fall-workshop.html",
    "tags": ["career", "cybersecurity", "crowdstrike", "ncl", "events", "internships", "networking"]
  }
]
